name: "flood_area_segmentation"
platform: "tensorrt_plan"

max_batch_size: 4

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [3, -1, -1]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [1, -1, -1]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]
